
// Управление инициализацией приложения во время запуска.
//
Процедура ВыполнитьИнициализацию() Экспорт

	ИнициализацияЕдиницИзмерения();
	
	ИнициализацияВидовПиломатериалов();

КонецПроцедуры // ВыполнитьИнициализацию
 

// Выполняет инициализацию единиц измерения при первом запуске
// или в случае, если настройки приложения были сброшены.
//
Процедура ИнициализацияЕдиницИзмерения()
	
	// Проверка базовой единицы измерения
	//
	ЕдБазовая = Константы.БазоваяЕдиницаИзмерения.Получить();
	Если ЕдБазовая = Неопределено ИЛИ ЕдБазовая = Перечисления.ЕдиницыИзмерения.ПустаяСсылка() Тогда
		Константы.БазоваяЕдиницаИзмерения.Установить(Перечисления.ЕдиницыИзмерения.Миллиметр);
	КонецЕсли;
	

	// Проверка единиц ширины
	//
	ЕдШирины = Константы.ЕдиницаШирины.Получить();
	Если ЕдШирины = Неопределено ИЛИ ЕдШирины = Перечисления.ЕдиницыИзмерения.ПустаяСсылка() Тогда
		Константы.ЕдиницаШирины.Установить(Перечисления.ЕдиницыИзмерения.Миллиметр);
	КонецЕсли;
	
	
	// Проверка единиц высоты
	//
	ЕдВысоты = Константы.ЕдиницаВысоты.Получить();
	Если ЕдВысоты = Неопределено ИЛИ ЕдВысоты = Перечисления.ЕдиницыИзмерения.ПустаяСсылка() Тогда
		Константы.ЕдиницаВысоты.Установить(Перечисления.ЕдиницыИзмерения.Миллиметр);
	КонецЕсли;
	
	
	// Проверка единиц длины
	//
	ЕдДлины = Константы.ЕдиницаДлины.Получить();
	Если ЕдДлины = Неопределено ИЛИ ЕдДлины = Перечисления.ЕдиницыИзмерения.ПустаяСсылка() Тогда
		Константы.ЕдиницаДлины.Установить(Перечисления.ЕдиницыИзмерения.Метр);
	КонецЕсли;

КонецПроцедуры // ИнициализацияЕдиницИзмерения

Процедура ИнициализацияВидовПиломатериалов()

	ТекстЗапроса = "ВЫБРАТЬ
	               |	ВидыПиломатериалов.Ссылка КАК Ссылка,
	               |	ВидыПиломатериалов.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
	               |ИЗ
	               |	Справочник.ВидыПиломатериалов КАК ВидыПиломатериалов
	               |ГДЕ
	               |	ВидыПиломатериалов.Предопределенный
	               |	И ВидыПиломатериалов.ТипПиломатериала = ЗНАЧЕНИЕ(Перечисление.ТипыПиломатериалов.ПустаяСсылка)";
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		
		Об = Рез.Ссылка.ПолучитьОбъект();
		Изменен = Ложь; // Если вносились изменения
		ИмяПредопределенныхДанных = Рез.ИмяПредопределенныхДанных;
		
		Если ИмяПредопределенныхДанных = "Брус_100_100_6000" Тогда
			Об.ТипПиломатериала = Перечисления.ТипыПиломатериалов.Брус;
			Об.Ширина 			= 100;
			Об.Высота 			= 100;
			Об.Длина 			= 6000;
			Об.ЕдиницаШирины 	= Перечисления.ЕдиницыИзмерения.Миллиметр;
			Об.ЕдиницаВысоты 	= Перечисления.ЕдиницыИзмерения.Миллиметр;
			Об.ЕдиницаДлины 	= Перечисления.ЕдиницыИзмерения.Миллиметр;
			Изменен 			= Истина;
		ИначеЕсли ИмяПредопределенныхДанных = "Брус_150_150_6000" Тогда
			Об.ТипПиломатериала = Перечисления.ТипыПиломатериалов.Брус;
			Об.Ширина 			= 150;
			Об.Высота 			= 150;
			Об.Длина 			= 6000;
			Об.ЕдиницаШирины 	= Перечисления.ЕдиницыИзмерения.Миллиметр;
			Об.ЕдиницаВысоты 	= Перечисления.ЕдиницыИзмерения.Миллиметр;
			Об.ЕдиницаДлины 	= Перечисления.ЕдиницыИзмерения.Миллиметр;
			Изменен 			= Истина;
		КонецЕсли;
		
		Если Изменен Тогда
			Справочники.ВидыПиломатериалов.СформироватьНаименование(Об);
			Об.Записать();
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры // ИнициализацияВидовПиломатериалов
 
 